{
  "0.1.0": {
    "en": "Intial version"
  },
  "0.2.0": {
    "en": "Undocumented and lost version"
  },
  "0.3.0": {
    "en": "Project forked and app ownership in Homey store transfered to baldhors@gmail.com. Added support for ESPhome based cover. Please log issues on the github project!"
  },
  "0.3.1": {
    "en": "Added support for button (untested)"
  },
  "0.3.2": {
    "en": "Attempt to solve capabilities and cards handled by the app in homey store"
  },
  "0.3.3": {
    "en": "Added support for consoleRe, it can be enabled from app settings"
  },
  "0.3.4": {
    "en": "Fixed issues #8, #9 and #10. Also include a fix to console.re to avoid stackcall overflow"
  },
  "0.3.5": {
    "en": "Improved console.re support, now ensure none of the log messages are lost at start of the application."
  },
  "0.3.6": {
    "en": "Fixed a timeout handling in console.re client"
  },
  "0.4.0": {
    "en": "BETA: new wizard driver, fully independant from legacy driver, so no risk of collision. USE AT YOUR OWN RISK"
  },
  "0.4.1": {
    "en": "BETA: refacto of wizard driver, imply breaking changes (sorry). The wizard driver should be stable enough to avoid breaking changes in the future"
  },
  "0.4.2": {
    "en": "Wizard is fully implemented. Still in BETA as more testing is necessary"
  },
  "0.4.3": {
    "en": "A few fix to Wizard driver"
  },
  "0.4.4": {
    "en": "FIX: few fix for edge cases"
  },
  "0.4.5": {
    "en": "WIZARD: Added support for title option a few more things"
  },
  "0.4.6": {
    "en": "Can create a virtual device directly from the native capability list + some fix\""
  },
  "0.5.0": {
    "en": "Legacy driver is deprecated, long life to the wizard!"
  },
  "0.5.1": {
    "en": "Wizard is not in BETA anymore, legacy driver is deprecated"
  },
  "0.5.2": {
    "en": "Added community link"
  },
  "0.5.3": {
    "en": "password are now supported as expected"
  },
  "0.5.4": {
    "en": "Fixed #19, and now all logs from the browser will also be sent to console.re. Passwords are filtered out in a generic way to ensure even new logs will not include passwords!"
  },
  "0.5.5": {
    "en": "No more circular reference in console.re and it is now possible to modify a device settings through the wizard (ip address, port and password)"
  },
  "0.6.0": {
    "en": "Added support for encryption key. Improved new_device / update settyings views"
  },
  "0.6.1": {
    "en": "Added logs"
  },
  "0.6.2": {
    "en": "fix: length of encryption key in new_device view"
  },
  "0.6.3": {
    "en": "Added support for template cover"
  },
  "0.6.4": {
    "en": "Fixed: Errors where not correctly sent to console.re. Fix: Added error management for unexisting native capability used by a virtual device"
  },
  "0.6.5": {
    "en": "Fix: added compatible with virtual devices created before implementation of encryption key support"
  },
  "0.6.6": {
    "en": "Improved console.re logs. console.re will deactivate after 2 consecutive days\""
  },
  "0.6.7": {
    "en": "Fixed issue in console.re auto disable"
  },
  "0.6.8": {
    "en": "Fixed 2 bugs when the entityId change (entityId are calculated by esphome on the name of the entity, so if you change them, the id change)"
  },
  "0.7.0": {
    "en": "The wizard can now modify a virtual device's class"
  },
  "0.7.1": {
    "en": "Added tags to help find the app in Homey store"
  },
  "0.7.2": {
    "en": "Fixed #28: The driver should correctly reconnect to the physical device if"
  },
  "0.7.3": {
    "en": "Testing fix for #35: reconnection is now handled at high level client, not low level"
  },
  "0.7.4": {
    "en": "Fixed a null crash case"
  },
  "1.0.0": {
    "en": "Full redesign of the wizard, this version is for TEST purpose ONLY"
  }
}
